[
    {
        "question": "The greatest Egyptian pyramids at Giza were built:",
        "expected_answer": "as burial monuments for the pharaoh Khufu, Khufu's son Khafre, and Khufu's grandson Menkaure.",
        "response": null
    },
    {
        "question": "When anatomically modern humans first arrived in the Middle East, who did they encounter?",
        "expected_answer": "Neandertals, the evolutionary descendants of the premodern human inhabitants of Europe and Asia",
        "response": null
    },
    {
        "question": "The “Lion Man” from Hohlenstein-Stadel cave is an example of:",
        "expected_answer": "mobiliary art.",
        "response": null
    },
    {
        "question": "At its peak, the palace at Knossos is thought to have had over _________ rooms.",
        "expected_answer": "1,000",
        "response": null
    },
    {
        "question": "The Hopewell were complex rank societies, but they were not a state. Hopewell culture lacked all of the following elements EXCEPT:",
        "expected_answer": "monumental earthworks",
        "response": null
    },
    {
        "question": "Markings found on the mud-bricks of Huaca del Sol are probably:",
        "expected_answer": "intended to identify the local group that had produced them.",
        "response": null
    },
    {
        "question": "The 30 upright stones at Stonehenge are called _______; the horizontal stones are _________.",
        "expected_answer": "sarsens, lintels",
        "response": null
    },
    {
        "question": "The secondarily altricial condition of modern human babies may have been an evolutionary solution, in that:",
        "expected_answer": "it allowed for subsequent growth of the brain, since bipedalism had resulted in a narrowed birth canal in the female pelvis.",
        "response": null
    },
    {
        "question": "Research on C3 and C4 pathways indicates that changes in plant communities were associated with a transition in the diets of ancient hominids from:",
        "expected_answer": "nuts and fruits to species more focused on grasses.",
        "response": null
    },
    {
        "question": "Which of the following is evidence of new uses for plants during the Middle Stone Age?",
        "expected_answer": "plant material lining the floor of Sibudu Cave in South Africa",
        "response": null
    },
    {
        "question": "That modern Africans do not possess any Neandertal DNA indicates that:",
        "expected_answer": "Gene flow between Neandertals and anatomically modern humans occurred after anatomically modern humans migrated out of Africa.",
        "response": null
    },
    {
        "question": "Toward the end of the Pleistocene, between 28,000 and 18,000 years ago, worldwide sea level was much lower than present day, resulting in the exposure of a landmass east of Siberia called __________. This period is called the _______.",
        "expected_answer": "Beringia; Late Glacial Maximum",
        "response": null
    },
    {
        "question": "Which archaeological method is best for identifying large-scale land modifications?",
        "expected_answer": "aerial photography",
        "response": null
    },
    {
        "question": "What designation for a pottery style was eventually applied to an entire cultural complex that moved across the Pacific?",
        "expected_answer": "Lapita",
        "response": null
    },
    {
        "question": "What is one of the differences between simple foragers and complex foragers?",
        "expected_answer": "Complex foragers focus on a few highly productive resources.",
        "response": null
    },
    {
        "question": "The significance of Frere's discovery was that what he found was located:",
        "expected_answer": "beneath the remains of extinct animals.",
        "response": null
    },
    {
        "question": "What is the earliest form of writing in the world and where did it develop?",
        "expected_answer": "cuneiform, in Mesopotamia",
        "response": null
    },
    {
        "question": "A pattern of social integration in which individuals are placed into a hierarchy of social levels is called:",
        "expected_answer": "social stratification.",
        "response": null
    },
    {
        "question": "The Minoan economy may have been especially vulnerable to natural catastrophe because it relied heavily on:",
        "expected_answer": "maritime trade",
        "response": null
    },
    {
        "question": "The _______ developed one of the earliest kingdoms in South America, reaching its height at around _________.",
        "expected_answer": "Moche; AD 400",
        "response": null
    },
    {
        "question": "What is the name of the lithic technology seen in the Arctic and consisting of wedge-shaped cores, micro-blades, bifacial knives, and burins?",
        "expected_answer": "Denali Complex",
        "response": null
    },
    {
        "question": "Which of the following is used to remove the soil enclosing site materials?",
        "expected_answer": "all of the above",
        "response": null
    },
    {
        "question": "A continuous, projecting ridge of bone above and across the eye orbits is called the:",
        "expected_answer": "supraorbital torus.",
        "response": null
    },
    {
        "question": "Ancestral Puebloan culture in Chaco Canyon was comprised of:",
        "expected_answer": "around 75 substantial settlements and more than 300 smaller communities.",
        "response": null
    },
    {
        "question": "The Yang-shao culture gave way to the Lung-Shan sometime after:",
        "expected_answer": "5,000 B.P.",
        "response": null
    },
    {
        "question": "The most prominent feature of the food resource base of post-Pleistocene Europe was its:",
        "expected_answer": "diversity.",
        "response": null
    },
    {
        "question": "Evidence of wild grain harvesting and consumption in Israel dates to as early as",
        "expected_answer": "20,000 B.P.",
        "response": null
    },
    {
        "question": "Civilization in the Indus Valley was characterized by:",
        "expected_answer": "all of the above.",
        "response": null
    },
    {
        "question": "According to one theory, the power of Ancestral Pueblo elites emerged when certain groups:",
        "expected_answer": "stored food surpluses in good years for distribution in bad years.",
        "response": null
    },
    {
        "question": "Teotihuacán came to prominence in the Basin of Mexico after its rival, Cuicuilco,",
        "expected_answer": "was crippled by a volcanic eruption.",
        "response": null
    },
    {
        "question": "Evidence from northwest coast societies indicates that what is ultimately needed for the development of social complexity is:",
        "expected_answer": "a food surplus.",
        "response": null
    },
    {
        "question": "Which subfield of anthropology aims to better understand the nearest living relatives of humans?",
        "expected_answer": "primatology",
        "response": null
    },
    {
        "question": "How did Aurignacian technology differ from Mousterian technology?",
        "expected_answer": "Aurignacian technology produced more usable blade surface.",
        "response": null
    },
    {
        "question": "Which of the following is evidence of a complex society?",
        "expected_answer": "monumental works",
        "response": null
    },
    {
        "question": "The face of Homo erectus was more ________ than modern humans, but less so than Homo habilis.",
        "expected_answer": "prognathous",
        "response": null
    },
    {
        "question": "Montezuma ruled over millions of people from the _______ capital of _____.",
        "expected_answer": "Aztec; Tenochtitlán.",
        "response": null
    },
    {
        "question": "The belief that all of the characteristics of civilization developed in one place, such as Egypt, and from there spread out to the rest of the world is known as:",
        "expected_answer": "diffusionism",
        "response": null
    },
    {
        "question": "When the ratio of brain size to body size is compared, which species has a proportionally larger brain?",
        "expected_answer": "modern Homo sapiens",
        "response": null
    },
    {
        "question": "The royal graves of the Shang Dynasty consisted of enormous cruciform-shaped tombs, where the deceased kings were buried with:",
        "expected_answer": "all of the above.",
        "response": null
    },
    {
        "question": "The above hominid species discovered in Malapa Cave in South Africa has been classified as:",
        "expected_answer": "Australopithecus sediba.",
        "response": null
    },
    {
        "question": "Ethnographic evidence supports which of the following connections between surplus food and social complexity?",
        "expected_answer": "Some resource-rich environments allow for the creation of surpluses that can lead to economic inequalities and social complexity.",
        "response": null
    },
    {
        "question": "Which of the following was the greatest advantage of using fire in human evolution?",
        "expected_answer": "Fire makes meat more digestible and kills bacteria.",
        "response": null
    },
    {
        "question": "Palynology is the study of _________, which allows scientists to reconstruct ______.",
        "expected_answer": "pollen; plant communities and climate.",
        "response": null
    },
    {
        "question": "What was the unifying element of Olmec culture?",
        "expected_answer": "religious iconography",
        "response": null
    },
    {
        "question": "Which of the following ancient civilizations has a written language that is the furthest from being fully deciphered?",
        "expected_answer": "the Indus Valley",
        "response": null
    },
    {
        "question": "The sophisticated stone tool making industry at the Pinnacle Point site in South Africa is evidence of:",
        "expected_answer": "a 71,000-year-old complex sequence of microblade production and use.",
        "response": null
    },
    {
        "question": "Early evidence of complexity in Mayan societies is suggested by the appearance, around 2650 B.P., of:",
        "expected_answer": "decorated stepped platforms.",
        "response": null
    },
    {
        "question": "What do anthropologists NOT need to know to determine when people entered the Americas from Siberia?",
        "expected_answer": "When sled dogs were first domesticated",
        "response": null
    },
    {
        "question": "When did Aborigines occupy the harsh interior of Australia?",
        "expected_answer": "20,000–25,000 years ago",
        "response": null
    },
    {
        "question": "What do the Hassunan and Samarran sites in Mesopotamia have in common?",
        "expected_answer": "Both relied heavily on agriculture.",
        "response": null
    }
]